In [1]:
import pandas as pd

In [4]:
#dataset
data={
    "Student":["Amit","Jhon","Kapil","Mukund","Sachin"],
    "Rank":[1,4,3,5,2],
    "Marks":[90,70,80,60,90]
     }
df=pd.DataFrame(data,index=["Student1","Student2","Student3","Student4","Student5"])

In [5]:
df

         Student  Rank  Marks
Student1    Amit     1     90
Student2    Jhon     4     70
Student3   Kapil     3     80
Student4  Mukund     5     60
Student5  Sachin     2     90